
Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр Начисления
	
	Для Каждого ТекСтрокаНачисления Из Начисления Цикл
		Движение = Движения.Начисления.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ТекСтрокаНачисления.ВидРасчета;
		Движение.ПериодДействияНачало = ТекСтрокаНачисления.ДатаНачала;
		Движение.ПериодДействияКонец = ТекСтрокаНачисления.ДатаОкончания;
		Движение.ПериодРегистрации = Дата;
		Движение.Сотрудник = ТекСтрокаНачисления.Сотрудник;
		Движение.Показатель = ТекСтрокаНачисления.СуммаОклада;
	КонецЦикла;
    Движения.Начисления.Записать();
	
	Для Каждого Движение Из Движения.Начисления Цикл
		
		Если Движение.ВидРасчета <> ПланыВидовРасчета.Начисления.Оклад Тогда
			Продолжить;
		КонецЕсли;
		
		План = Движение.ПолучитьДанныеГрафика(ВидПериодаРегистраРасчета.ПериодДействия);
		Факт = Движение.ПолучитьДанныеГрафика(ВидПериодаРегистраРасчета.ФактическийПериодДействия);
		
		Результат = Движение.Показатель / План[0].РабочихДней * Факт[0].РабочихДней;
		Движение.Результат = Результат;
		Движения.Начисления.Записать( ,Истина);
		
	КонецЦикла;
	
КонецПроцедуры
