
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Для Каждого ТекСтрокаСотрудники Из Сотрудники Цикл
		Движение = Движения.Начисления.Добавить();
		Движение.Сторно = Ложь; 
		Движение.ВидРасчета = ПланыВидовРасчета.Начисления.ПремияПроцентом;
		Движение.ПериодДействияНачало = НачалоМесяца(Дата);
		Движение.ПериодДействияКонец = КонецМесяца(Дата);
		Движение.ПериодРегистрации = Дата;
		Движение.БазовыйПериодНачало = НачалоМесяца(Дата);
		Движение.БазовыйПериодКонец = НачалоМесяца(Дата);
		Движение.Сотрудник = ТекСтрокаСотрудники.Сотрудник;
		Движение.Показатель = ТекСтрокаСотрудники.ПроцентПремии;
	КонецЦикла;
	
	Движения.Начисления.Записать(); 
	
	РасчетПремииПроцентом();
	
КонецПроцедуры

Процедура РасчетПремииПроцентом()
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ЗарплатаБазаЗарплата.Сотрудник КАК Сотрудник,
	|	ЗарплатаБазаЗарплата.СуммаБаза КАК СуммаБаза
	|ИЗ
	|	РегистрРасчета.Зарплата.БазаЗарплата(
	|			&Измерения,
	|			&Измерения,
	|			,
	|			Регистратор = &Регистратор
	|				И ВидРасчета = &ВидРасчета) КАК ЗарплатаБазаЗарплата");
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	Запрос.УстановитьПараметр("ВидРасчета", ПланыВидовРасчета.Начисления.ПремияПроцентом);
	Измерения = Новый Массив;
	Измерения.Добавить("Сотрудник");
	Запрос.УстановитьПараметр("Измерения", Измерения);
	Выборка = Запрос.Выполнить().Выбрать(); 
	Пока Выборка.Следующий() Цикл
		Сообщить(Выборка.Сотрудник);
	КонецЦикла;
	
	Движения.Начисления.Записать( ,Истина);
КонецПроцедуры
