
Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр Начисления
	Для Каждого ТекСтрокаНачисления Из Начисления Цикл
		Движение = Движения.Начисления.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ВидРасчета;
		Движение.ПериодДействияНачало = НачалоМесяца(Дата);
		Движение.ПериодДействияКонец = КонецМесяца(Дата);
		Движение.ПериодРегистрации = Дата;
		Движение.Сотрудник = ТекСтрокаНачисления.Сотрудник;
		Движение.Результат = ТекСтрокаНачисления.Результат;
	КонецЦикла;
	
	Движения.Начисления.Записать();
	
	
КонецПроцедуры
