
&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Диаграмма.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	НачисленияФактическийПериодДействия.ВидРасчета КАК ВидРасчета,
	               |	НачисленияФактическийПериодДействия.Сотрудник КАК Сотрудник,
	               |	НачисленияФактическийПериодДействия.ПериодДействияНачало КАК Начало,
	               |	НачисленияФактическийПериодДействия.ПериодДействияКонец КАК Конец
	               |ИЗ
	               |	РегистрРасчета.Начисления.ФактическийПериодДействия КАК НачисленияФактическийПериодДействия";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Точка = Диаграмма.УстановитьТочку(Выборка.Сотрудник);
		Серия = Диаграмма.УстановитьСерию(Выборка.ВидРасчета);
		
		Значение = Диаграмма.ПолучитьЗначение(Точка, Серия);
		Интервал = Значение.Добавить();
		Интервал.Начало = Выборка.Начало;
		Интервал.Конец = Выборка.Конец;
	
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры
